# Building mySQL Data-base

In [1]:
import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np

import warnings
warnings.filterwarnings('ignore')


import pylab as plt  # import matplotlib.pyplot as plt
import seaborn as sns

# 1. Exploración y limpieza de los datos.

# 1.1 DataFrame Actor.

In [2]:
df_original_actor = pd.read_csv('data/actor.csv', encoding='latin1')
df_actor = df_original_actor.copy()

In [3]:
dim_original_actor = df_actor.shape # De esta forma guardo las dimensiones del data frame original.
df_actor.shape

(200, 4)

In [4]:
df_actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [5]:
df_actor.info() # De este modo conzco el tipo de dato y los valores nulos que tiene cada una de las columnas.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [6]:
df_actor.actor_id.unique() # Este procedimiento me ayuda a encontrar cada uno de los valores de la columna especificada.

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156,
       157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
       170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
       183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195,
       196, 197, 198, 199, 200])

In [7]:
df_actor.first_name.unique()

array(['PENELOPE', 'NICK', 'ED', 'JENNIFER', 'JOHNNY', 'BETTE', 'GRACE',
       'MATTHEW', 'JOE', 'CHRISTIAN', 'ZERO', 'KARL', 'UMA', 'VIVIEN',
       'CUBA', 'FRED', 'HELEN', 'DAN', 'BOB', 'LUCILLE', 'KIRSTEN',
       'ELVIS', 'SANDRA', 'CAMERON', 'KEVIN', 'RIP', 'JULIA', 'WOODY',
       'ALEC', 'SISSY', 'TIM', 'MILLA', 'AUDREY', 'JUDY', 'BURT', 'VAL',
       'TOM', 'GOLDIE', 'JODIE', 'KIRK', 'REESE', 'PARKER', 'FRANCES',
       'ANNE', 'NATALIE', 'GARY', 'CARMEN', 'MENA', 'FAY', 'JUDE',
       'DUSTIN', 'HENRY', 'JAYNE', 'RAY', 'ANGELA', 'MARY', 'JESSICA',
       'KENNETH', 'MICHELLE', 'ADAM', 'SEAN', 'ANGELINA', 'CARY',
       'GROUCHO', 'MAE', 'RALPH', 'SCARLETT', 'BEN', 'JAMES', 'MINNIE',
       'GREG', 'SPENCER', 'CHARLIZE', 'CHRISTOPHER', 'ELLEN', 'DARYL',
       'GENE', 'MEG', 'CHRIS', 'JIM', 'SUSAN', 'WALTER', 'SIDNEY', 'GINA',
       'WARREN', 'SYLVESTER', 'RUSSELL', 'MORGAN', 'HARRISON', 'RENEE',
       'LIZA', 'SALMA', 'JULIANNE', 'ALBERT', 'CATE', 'GRETA', 'JANE',
       'RICHARD', 'RITA', 'EWAN', 'WHOOPI', 'JADA', 'RIVER', 'KIM',
       'EMILY', 'GEOFFREY', 'MERYL', 'IAN', 'LAURA', 'HARVEY', 'OPRAH',
       'HUMPHREY', 'AL', 'LAURENCE', 'WILL', 'OLYMPIA', 'ALAN', 'MICHAEL',
       'WILLIAM', 'JON', 'LISA', 'JEFF', 'DEBBIE', 'ROCK', 'GREGORY',
       'JOHN', 'BELA', 'THORA'], dtype=object)

In [8]:
df_actor.last_name.unique()

array(['GUINESS', 'WAHLBERG', 'CHASE', 'DAVIS', 'LOLLOBRIGIDA',
       'NICHOLSON', 'MOSTEL', 'JOHANSSON', 'SWANK', 'GABLE', 'CAGE',
       'BERRY', 'WOOD', 'BERGEN', 'OLIVIER', 'COSTNER', 'VOIGHT', 'TORN',
       'FAWCETT', 'TRACY', 'PALTROW', 'MARX', 'KILMER', 'STREEP', 'BLOOM',
       'CRAWFORD', 'MCQUEEN', 'HOFFMAN', 'WAYNE', 'PECK', 'SOBIESKI',
       'HACKMAN', 'DEAN', 'DUKAKIS', 'BOLGER', 'MCKELLEN', 'BRODY',
       'DEGENERES', 'MIRANDA', 'JOVOVICH', 'STALLONE', 'GOLDBERG',
       'BARRYMORE', 'DAY-LEWIS', 'CRONYN', 'HOPKINS', 'PHOENIX', 'HUNT',
       'TEMPLE', 'PINKETT', 'HARRIS', 'CRUISE', 'AKROYD', 'TAUTOU',
       'NEESON', 'WRAY', 'HUDSON', 'TANDY', 'BAILEY', 'WINSLET',
       'MCCONAUGHEY', 'GRANT', 'WILLIAMS', 'PENN', 'KEITEL', 'POSEY',
       'ASTAIRE', 'SINATRA', 'CRUZ', 'DAMON', 'JOLIE', 'WILLIS', 'PITT',
       'ZELLWEGER', 'CHAPLIN', 'PESCI', 'DENCH', 'PRESLEY', 'HAWKE',
       'BRIDGES', 'DEPP', 'LEIGH', 'CROWE', 'DUNST', 'NOLTE', 'DERN',
       'BACALL', 'MCDORMAND', 'BALE', 'ALLEN', 'JACKMAN', 'MONROE',
       'BERGMAN', 'BENING', 'TOMEI', 'GARLAND', 'HOPPER', 'REYNOLDS',
       'MANSFIELD', 'DEE', 'GOODING', 'HURT', 'RYDER', 'WITHERSPOON',
       'HESTON', 'GIBSON', 'MALDEN', 'BASINGER', 'HOPE', 'WEST',
       'BULLOCK', 'WILSON', 'PFEIFFER', 'DREYFUSS', 'SILVERSTONE',
       'CARREY', 'CLOSE', 'BALL', 'BIRCH', 'SUVARI', 'WALKEN'],
      dtype=object)

In [9]:
df_actor.last_update.unique()

array(['2006-02-15 04:34:33'], dtype=object)

Como se puede observar en la columna recién mencionada ("last_update"), todos sus valores son idénticos y se repiten de manera constante a lo largo de toda la columna. Por este motivo, al no aportar ninguna información relevante, se procede a su eliminación.

In [10]:
df_actor.drop(columns=["last_update"], inplace=True)

In [11]:
df_actor.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

Considero que la combinación de las columnas "first_name" y  "last_name" en una sola columna llamada "actor_name," que contendría el nombre completo de la persona, simplicaría el posterior trabajo y manejo de la tabla.

In [12]:
df_actor["actor_name"] = df_actor["first_name"] + ' ' + df_actor["last_name"]

In [13]:
df_actor.drop(columns=["first_name"], inplace=True) #Borro aquí las columnas que me ha proporcionado la información para la creación de la nueva columna.
df_actor.drop(columns=["last_name"], inplace=True)

In [14]:
df_actor.head()

   actor_id           actor_name
0         1     PENELOPE GUINESS
1         2        NICK WAHLBERG
2         3             ED CHASE
3         4       JENNIFER DAVIS
4         5  JOHNNY LOLLOBRIGIDA

In [72]:
df_actor["actor_name"].value_counts()

PENELOPE GUINESS        1
KEVIN GARLAND           1
DARYL CRAWFORD          1
GRETA KEITEL            1
JANE JACKMAN            1
                       ..
MICHELLE MCCONAUGHEY    1
ADAM GRANT              1
SEAN WILLIAMS           1
GARY PENN               1
THORA TEMPLE            1
Name: actor_name, Length: 199, dtype: int64

Al examinar los valores únicos en la columna "actor_name," notamos la presencia de un valor repetido. Ante esta situación, cabrían dos opciones: mantenerlo tal como está, ya que los identificadores (ID) son diferentes, o eliminarlo. 

En este caso, vamos a ponernos en la situación y considerar que se trata de dos personas distintas y, por lo tanto, procedemos a eliminar una de las filas en las que se encuentra dicho valor.

In [17]:
fila_susan = df_actor[df_actor["actor_name"] == "SUSAN DAVIS"]
fila_susan

     actor_id   actor_name
100       101  SUSAN DAVIS
109       110  SUSAN DAVIS

In [18]:
df_actor = df_actor.drop(109)

In [19]:
df_actor = df_actor.reset_index(drop=True)

In [20]:
df_actor.head()

   actor_id           actor_name
0         1     PENELOPE GUINESS
1         2        NICK WAHLBERG
2         3             ED CHASE
3         4       JENNIFER DAVIS
4         5  JOHNNY LOLLOBRIGIDA

In [21]:
df_actor.shape

(199, 2)

In [23]:
# Columnas que contienen valores nulos y la cantidad de estos en cada una de ellas:

nan_cols_actor = df_actor.isna().sum() #En este caso vemos que ninguna.
nan_cols_actor[nan_cols_actor>0]

Series([], dtype: int64)

# 1.2 DataFrame Category.

In [24]:
df_original_category = pd.read_csv('data/category.csv', encoding='latin1')
df_category = df_original_category.copy()

In [26]:
dim_original_category = df_category.shape # Del mismo modo que antes, guardo las dimensiones del data frame original.
df_category.shape

(16, 3)

In [27]:
df_category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [29]:
df_category.info() # Observamos el tipo de dato y los posibles valores nulos que tiene cada una de las columnas.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 516.0+ bytes

In [31]:
df_category.category_id.unique() # Ahora, los valores únicos de las diferentes columnas que componen el DataFrame.

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16])

In [32]:
df_category.name.unique()

array(['Action', 'Animation', 'Children', 'Classics', 'Comedy',
       'Documentary', 'Drama', 'Family', 'Foreign', 'Games', 'Horror',
       'Music', 'New', 'Sci-Fi', 'Sports', 'Travel'], dtype=object)

No se aprecia nada raro hasta que nos encontramos, al igual que en el caso anterior, con la columna "last_update", compuesta por un único valor que no nos aporta ninguna información destacable. Se procede a su eliminación:

In [35]:
df_category.last_update.unique()

array(['2006-02-15 04:46:27'], dtype=object)

In [36]:
df_category.drop(columns=["last_update"], inplace=True)

In [39]:
df_category["name"].value_counts().head() # Revisamos en este caso si también hay algún valor repetido a lo largo de la columna.

Action       1
Animation    1
Children     1
Classics     1
Comedy       1
Name: name, dtype: int64

Considero que sería una buena práctica cambiar el nombre de la columna "name" por motivo de que este nombre de columna se repite en varias tablas con las que debemos trabajar. Esto podría causar confusión cuando manejemos todas las tablas en conjunto.

In [42]:
df_category.rename(columns={"name": "category_name"}, inplace=True)

In [47]:
# Columnas que contienen valores nulos y la cantidad de estos en cada una de ellas:

nan_cols_category = df_category.isna().sum() #De nuevo, ninguna.
nan_cols_category[nan_cols_category>0]

Series([], dtype: int64)

In [43]:
df_category.head()

   category_id category_name
0            1        Action
1            2     Animation
2            3      Children
3            4      Classics
4            5        Comedy

# 1.3 DataFrame Film.

In [44]:
df_original_film = pd.read_csv('data/film.csv', encoding='latin1')
df_film = df_original_film.copy()

In [48]:
dim_original_film = df_film.shape # Guardo aquí también las dimensiones del data frame original.
df_film.shape

(1000, 13)

In [49]:
df_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [50]:
df_film.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

Primeramente, según la información proporcionada anteriormente, se aprecia que existe una columna en la que todos sus valores son nulos. Por lo tanto, el primer paso será eliminar dicha columna.

In [51]:
df_film.drop(columns=['original_language_id'], inplace=True)

Seguidamente, resulta de interés determinar si alguna de las columnas contiene valores constantes, ya que estos no aportan información adicional o especialmnete relevante. En caso de hallar dichas columnas, se considerará su eliminación.

In [52]:
cte_cols_film = []
for c in df_film.select_dtypes(include=np.number):   # para cada columna numerica.....
    if len(df_film[c].unique()) == 1:
        cte_cols_film.append(c)
cte_cols_film

['release_year', 'language_id']

De hecho, se han identificado dos columnas que cumplen con esta condición (estas deberán eliminarse). 

Sin embargo, es relevante destacar que esta revisión se ha realizado únicamente en las columnas numéricas. No obstante, es necesario considerar que otras columnas podrían presentar la misma situación. Comprobémoslo:

In [54]:
df_film.drop(columns=['release_year'], inplace=True) #primero eliminamos las dos columnas numéricas con valor constante.
df_film.drop(columns=['language_id'], inplace=True)

KeyError: "['release_year'] not found in axis"

In [55]:
df_film.last_update.unique()

array(['2006-02-15 05:03:42'], dtype=object)

Al parecer, esta también lo es, por lo que también debe eliminarse.

In [56]:
df_film.drop(columns=['last_update'], inplace=True)

Realizamos la prueba con el resto de ellas, como se puede apreciar a continuación, por el momento, no se reconoce nada sospechoso en las mismas.

In [57]:
#df_film.film_id.unique()

In [58]:
#df_film.title.unique()

In [59]:
#df_film.description.unique()

In [60]:
df_film.rental_duration.unique()

array([6, 3, 7, 5, 4])

In [61]:
#df_film.rental_rate.unique()

In [62]:
#df_film.length.unique()

In [63]:
#df_film.special_features.unique()

In [64]:
#df_film.length.unique()

Ahora, procederé a buscar posibles valores repetidos en alguna de las columnas en las que esto resulte raro, es decir, las no numéricas, en las cuales no hay problema alguno en que el valor se repita:

In [76]:
df_film["film_id"].value_counts()

1       1
672     1
659     1
660     1
661     1
       ..
339     1
340     1
341     1
342     1
1000    1
Name: film_id, Length: 1000, dtype: int64

In [77]:
df_film["title"].value_counts()

ACADEMY DINOSAUR    1
PERFECT GROOVE      1
PARK CITIZEN        1
PARTY KNOCK         1
PAST SUICIDES       1
                   ..
FROGMEN BREAKING    1
FRONTIER CABIN      1
FROST HEAD          1
FUGITIVE MAGUIRE    1
ZORRO ARK           1
Name: title, Length: 1000, dtype: int64

In [78]:
df_film["description"].value_counts()

A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies                   1
A Thrilling Yarn of a Dog And a Dog who must Build a Husband in A Baloon                                           1
A Taut Epistle of a Sumo Wrestler And a Girl who must Face a Husband in Ancient Japan                              1
A Fateful Display of a Technical Writer And a Butler who must Battle a Sumo Wrestler in An Abandoned Mine Shaft    1
A Intrepid Tale of a Madman And a Astronaut who must Challenge a Hunter in A Monastery                             1
                                                                                                                  ..
A Unbelieveable Yarn of a Mad Scientist And a Cat who must Chase a Lumberjack in Australia                         1
A Emotional Story of a Madman And a Waitress who must Battle a Teacher in An Abandoned Fun House                   1
A Amazing Reflection of a Lumberjack And a Cat who must Discover a Husband in A MySQL Convention                   1
A Taut Epistle of a Feminist And a Sumo Wrestler who must Battle a Crocodile in Australia                          1
A Intrepid Panorama of a Mad Scientist And a Boy who must Redeem a Boy in A Monastery                              1
Name: description, Length: 1000, dtype: int64

Revisamos que no haya ningún valor especialemnte atípico para cada una de las columnas númericas de la tabla.

In [65]:
df_film.describe().T

,count,mean,std,min,25%,50%,75%,max
film_id,1000.0,500.500,288.819436,1.00,250.75,500.50,750.25,1000.00
rental_duration,1000.0,4.985,1.411654,3.00,4.00,5.00,6.00,7.00
rental_rate,1000.0,2.980,1.646393,0.99,0.99,2.99,4.99,4.99
length,1000.0,115.272,40.426332,46.00,80.00,114.00,149.25,185.00
replacement_cost,1000.0,19.984,6.050833,9.99,14.99,19.99,24.99,29.99

Tanto la duración del alquiler, el coste de este, la duración o los costes de reposición no presentan nada que sea digno de anotar.

In [66]:
df_film.head()

,film_id,title,description,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,2.99,130,22.99,G,Deleted Scenes

Al ver el cabecero de la tabla, observo que en la columna de "special_features" las frases separadas por una "," no cuentan con el espacio que debe haber. Así, lo modifico:

In [69]:
df_film['special_features'] = df_film['special_features'].str.replace(',', ', ')

In [71]:
# Columnas que contienen valores nulos y la cantidad de estos en cada una de ellas:

nan_cols_film = df_film.isna().sum() #De nuevo, ninguna.
nan_cols_film[nan_cols_film>0]

Series([], dtype: int64)

In [70]:
df_film.head()

,film_id,title,description,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,0.99,86,20.99,PG,"Deleted Scenes, Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,4.99,48,12.99,G,"Trailers, Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,2.99,50,18.99,NC-17,"Trailers, Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,2.99,117,26.99,G,"Commentaries, Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,2.99,130,22.99,G,Deleted Scenes

In [74]:
df_film.shape

(1000, 9)

# 1.4 DataFrame Inventory.

In [81]:
df_original_inventory = pd.read_csv('data/inventory.csv', encoding='latin1')
df_inventory = df_original_inventory.copy()

In [82]:
dim_original_inventory = df_inventory.shape # De esta forma guardo las dimensiones del data frame original.
df_inventory.shape

(1000, 4)

In [83]:
df_inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [84]:
df_inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [87]:
df_inventory.last_update.unique() # De nuevo, el valor de esta columna está repetido a lo largo de todas ella. Lo eliminamos.

array(['2006-02-15 05:09:17'], dtype=object)

In [88]:
df_inventory.drop(columns=['last_update'], inplace=True)

In [94]:
#df_inventory.inventory_id.unique()

In [96]:
#df_inventory.film_id.unique()

In [97]:
df_inventory.store_id.unique()

array([1, 2])

La columna recién mencionada, "store_id" no guarda ninguna relación con el resto de las tablas. Sin embargo, puede contener información relevante acerca de que ubicación tenía un mayor rendimiento o mayores gananciales, de cara a la localización de la nueva tienda. Es decir, si, por ejemplo, deseamos evaluar cuál de las dos tiendas tenía un mejor rendimiento de cara su reapertura, es valioso mantenerla en la base de datos.

In [90]:
df_inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

# 1.4 DataFrame Language.

In [98]:
df_original_language = pd.read_csv('data/language.csv', encoding='latin1')
df_language = df_original_language.copy()

In [101]:
dim_original_language = df_language.shape # Guardamos las dimensiones del data frame original.
df_language.shape

(6, 3)

In [102]:
df_language.head(7)

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [103]:
df_language.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

Nos deshacemos, por el mismo motivo que hasta ahora, de la columna otra vez más, nos deshacemos de la columna "last_update":

In [104]:
df_language.last_update.unique()

array(['2006-02-15 05:02:19'], dtype=object)

In [105]:
df_language.drop(columns=['last_update'], inplace=True)

In [106]:
df_language.language_id.unique() #Esta información nos hace ver, al observar los

array([1, 2, 3, 4, 5, 6])

En el DataFrame "df_film", hemos eliminado una columna que indicaba el idioma de cada película. Esto se debió a que el valor en esa columna era idéntico en todas las filas, lo que sugiere que todas las películas en la base de datos están en el mismo idioma, en este caso, en inglés.

Esta observación plantea la pregunta de si es necesario mantener una tabla para almacenar información de idioma cuando todas las películas tienen el mismo. 

Sin embargo, he decidido conservar esta tabla en caso de que en el futuro se agreguen películas en otros idiomas. Puede resultar útil para catalogar y gestionar películas en diferentes idiomas si surge esa necesidad.

In [109]:
df_language.name.unique()

array(['English', 'Italian', 'Japanese', 'Mandarin', 'French', 'German'],
      dtype=object)

In [110]:
df_language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

# 1.5 DataFrame old_HDD.

In [111]:
df_original_old_hdd = pd.read_csv('data/old_HDD.csv', encoding='latin1')
df_old_hdd = df_original_old_hdd.copy()

In [112]:
dim_original_old_hdd = df_old_hdd.shape
df_old_hdd.shape

(1000, 5)

In [113]:
df_old_hdd.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [114]:
df_old_hdd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

Determinamos si alguna de las columnas contiene valores constantes con el fin de eliminarlos, por motivo de que no aportan información relevante.

In [115]:
cte_cols_old_hdd = []
for c in df_old_hdd.select_dtypes(include=np.number):   # para cada columna numerica.....   
    if len(df_old_hdd[c].unique()) == 1:    
        cte_cols_old_hdd.append(c)
cte_cols_old_hdd

['release_year']

Vemos que hay uno, lo eliminamos:

In [117]:
df_old_hdd.drop(columns=['release_year'], inplace=True)

A continuación, igual que en la tabla "df_actor", combino de las columnas "first_name" y "last_name" en una sola columna llamada "actor_name," que contendría el nombre completo de la persona.

Luego, elimino las recién combinadas: "first_name" y "last_name".

In [119]:
df_old_hdd['actor_name'] = df_old_hdd['first_name'] + ' ' + df_old_hdd['last_name']

In [120]:
df_old_hdd.head()

  first_name last_name                  title  category_id        actor_name
0   PENELOPE   GUINESS       ACADEMY DINOSAUR            6  PENELOPE GUINESS
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS            2  PENELOPE GUINESS
2   PENELOPE   GUINESS            ANGELS LIFE           13  PENELOPE GUINESS
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS           10  PENELOPE GUINESS
4   PENELOPE   GUINESS          CHEAPER CLYDE           14  PENELOPE GUINESS

In [127]:
df_old_hdd.drop(columns=['first_name'], inplace=True)
df_old_hdd.drop(columns=['last_name'], inplace=True)

KeyError: "['first_name'] not found in axis"

Después de un análisis, he llegado a la conclusión de que esta tabla contiene información valiosa en lo que respecta a los títulos de las películas y los nombres de los actores. Esta información podría servir como un vínculo entre las tablas "df_actor" y "df_film", algo que resulta de especial importancia.

Para lograr esto, planeo unir esta tabla con las columnas de "actor_id" y de "film_id" mediante "merge". Al hacerlo, incorporaré los identificadores (IDs) de actores y películas a esta tabla, lo que permitirá futuras consultas y análisis que involucren a ambas tablas.

In [128]:
df_old_hdd = df_old_hdd.merge(df_actor[['actor_name', 'actor_id']], on='actor_name', how='left')
df_old_hdd = df_old_hdd.merge(df_film[['title', 'film_id']], on='title', how='left')

In [125]:
df_old_hdd.head()

,title,category_id,actor_name,film_id_x,actor_id,film_id_y
0,ACADEMY DINOSAUR,6,PENELOPE GUINESS,1,1,1
1,ANACONDA CONFESSIONS,2,PENELOPE GUINESS,23,1,23
2,ANGELS LIFE,13,PENELOPE GUINESS,25,1,25
3,BULWORTH COMMANDMENTS,10,PENELOPE GUINESS,106,1,106
4,CHEAPER CLYDE,14,PENELOPE GUINESS,140,1,140

#En el caso concreto que proporcionaste, donde tienes una tabla que contiene películas y otra tabla que contiene categorías, es razonable mantener la relación entre ambas tablas utilizando una clave externa (category_id) en la tabla de películas. Esto sigue el principio de normalización de bases de datos y presenta varios beneficios:

Integridad de los datos: Al mantener una relación, puedes garantizar que las películas se asignen correctamente a las categorías mediante la clave externa (category_id). Esto previene la entrada de datos incorrectos o inconsistentes.
Eficiencia en el almacenamiento: Evitas la duplicación de datos innecesaria, lo que ahorra espacio de almacenamiento, especialmente si tienes muchas películas en diferentes categorías.
Facilita la actualización de categorías: Si necesitas modificar o agregar categorías en el futuro, solo tendrás que hacerlo en la tabla de categorías. Las películas relacionadas seguirán vinculadas a sus categorías correspondientes sin necesidad de cambios en la tabla de películas.
Facilita las consultas complejas: Si en el futuro necesitas realizar consultas que involucren la relación entre películas y categorías, mantener la relación facilitará estas consultas.
Por lo tanto, en este caso, te recomendaría mantener la relación y normalizar los datos, es decir, mantener las categorías en una tabla independiente y utilizar una clave externa para relacionar las películas con sus categorías. Esto ayudará a mantener la integridad de los datos y permitirá un mejor manejo de la información

In [ ]:
#ahora quiero cambiar el orden de las columnas

In [131]:
df_old_hdd["actor_name"].value_counts()

SANDRA KILMER          37
VAL BOLGER             35
UMA WOOD               35
RIP CRAWFORD           33
JULIA MCQUEEN          33
HELEN VOIGHT           32
KARL BERRY             31
WOODY HOFFMAN          31
VIVIEN BERGEN          30
LUCILLE TRACY          30
GRACE MOSTEL           30
ALEC WAYNE             29
JOHNNY LOLLOBRIGIDA    29
BURT DUKAKIS           29
CUBA OLIVIER           28
KIRSTEN PALTROW        27
FRED COSTNER           27
ELVIS MARX             26
TOM MCKELLEN           25
AUDREY OLIVIER         25
NICK WAHLBERG          25
BOB FAWCETT            25
ZERO CAGE              25
JOE SWANK              25
CAMERON STREEP         24
MILLA PECK             24
TIM HACKMAN            23
CHRISTIAN GABLE        22
JENNIFER DAVIS         22
ED CHASE               22
DAN TORN               22
KEVIN BLOOM            21
MATTHEW JOHANSSON      20
BETTE NICHOLSON        20
PENELOPE GUINESS       19
SANDRA PECK            19
SISSY SOBIESKI         18
JUDY DEAN              15
GOLDIE BRODY            7
Name: actor_name, dtype: int64

In [132]:
df_old_hdd["title"].value_counts()

BOONDOCK BALLROOM     6
FLASH WARS            5
STRANGER STRANGERS    5
OKLAHOMA JUMANJI      5
CHITTY LOCK           5
                     ..
FLYING HOOK           1
EGYPT TENENBAUMS      1
BUTCH PANTHER         1
TYCOON GATHERING      1
EXORCIST STING        1
Name: title, Length: 614, dtype: int64

In [ ]:
nuevo_orden = ['actor_id', 'film_id', 'name', 'title', 'category_id']

In [ ]:
df_old_hdd = df_old_hdd.reindex(columns=nuevo_orden)

In [ ]:
df_old_hdd.head()

# 1.6 DataFrame rental. (LIMPIARLA)

In [ ]:
df_original_rental = pd.read_csv('data/rental.csv', encoding='latin1')
df_rental = df_original_rental.copy()

In [ ]:
dim_original_rental = df_rental.shape # De esta forma guardo las dimensiones del data frame original.
df_rental.shape

In [ ]:
df_rental.head()

In [ ]:
df_rental.info()

In [ ]:
df_rental.last_update.unique()

In [ ]:
df_rental.drop(columns=['last_update'], inplace=True)

In [ ]:
df_rental['rental_date'] = pd.to_datetime(df_rental['rental_date'])

In [ ]:
df_rental['rental_date'] = df_rental['rental_date'].dt.date

In [ ]:
#y el tiempo concretoi nos da igual porque en el apartado de film solo tenemos cuanto tiempo (en días9 la gente ) ha alquiulado la película, por lo que la hora concreta nos da igual.

In [ ]:
df_rental.head()

In [ ]:
df_rental['return_date'] = pd.to_datetime(df_rental['return_date'])

In [ ]:
df_rental['return_date'] = df_rental['return_date'].dt.date

In [ ]:
df_rental.rental_date.unique()

In [ ]:
df_rental.head()

In [ ]:
df_rental.inventory_id.unique()

In [ ]:
#aquí hay muchos más regisros que en la parte de inventory_id en inventory, por lo que todos los números que sena más allá del 1000 los eliminaré.

In [ ]:
df_rental = df_rental[df_rental.inventory_id < 1001]

In [ ]:
df_rental.inventory_id.unique()

In [ ]:
#Quiero restar el return date - el rental date para saber cuantos días se tienen las pelis en casa

In [ ]:

# diferencia entre las fechas
df_rental['rental_duration'] = (df_rental['return_date'] - df_rental['rental_date']).dt.days

In [ ]:
df_rental.rental_duration.unique() #3,4,5,6,7

In [ ]:
df_rental.rental_date.unique()

In [ ]:
df_rental.return_date.unique()

In [ ]:
#podemos ver que los datos aquí no son muy consistentes. Realmente no nos aportan gran informaación para el estudio `porque no podemos generalizarla.
#en primer lugar, los datos están recogidos solo en un periodo muy corto de tiempo (solo el mes de mayo y junio) por lo que es una infotmación con la que no se puede hacer un estudio claro. Muestra muy pequeña.
#en segundo lugar, el periordo en el que la gente se queda las peliculas es diferente con respecto al de films. Donde los periorod soo oscilan entre 2 y 7. por lo tanto, solo conservaremos esos datos, el resto de datos, lo que no contienenuno de estos números, los eliminaremos. No podemos fiarnos, al igua que con los número que tienen un inventory_id mayor de 1000.

In [ ]:
#puede obeservarse que hay algo que tiene que estar mal porque la rental duration no coincide con la rental duration de la tabla fil.

In [ ]:
rental_durations_coincidentes = [3, 4, 5, 6, 7]
df_rental = df_rental[df_rental['rental_duration'].isin(rental_durations_coincidentes)]

In [ ]:
df_rental.rental_duration.unique()